CFDEM/CFDEMcoupling/tutorials/cfdemSolverCatalyticReactingRhoPimple/packedBedAdiabatic/CFD/constant/mechanism/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "mechanism";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

".*"
{
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}

solidSpecies
{
    specie
    {
        molWeight   100;
    }
    transport
    {
        mu          0;
        Pr          1;
    }
    thermodynamics
    {
        Cp          5.0;
        Cv          $Cp;
        Hf          0.0;
    }
    equationOfState
    {
        rho         2950.0;
    }
}

// ************************************************************************* //
